_orgs/_posts/java/2026-05-21-spring-ghost-transaction.org
#+Title:  Spring 事务 + 事务监听器引发的"幽灵事务"陷阱与架构层修复方案
#+AUTHOR:    zrg
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:6 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:/assets/js/org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/assets/css/org-manual.css" />
#+EXPORT_SELECT_TAGS: export
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:12px; color:darkblue}</style>
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_EXPORT HTML
---
layout: post
title: Spring 事务 + 事务监听器引发的"幽灵事务"陷阱与架构层修复方案
author: zrg
description: Spring 事务 + 事务监听器引发的"幽灵事务"陷阱与架构层修复方案
excerpt: 
comments: true
categories: 
- java
tags:
- Spring
- 事务
---
#+END_EXPORT

* 问题现象回顾
在"日采请购单审批回调"这条链路里发生了两个怪现象：
| 现象                   | 表现                                                                                        |
| ① 查不到上一步的数据   | autoCreateInWarehouseBill 查 purchaseBillQuery.queryBySourceId(billId) 拿不到刚创建的采购单 |
| ② 日志成功但数据不落库 | listener 打出 自动创建入库点检单成功，DB 里查不到入库点检单                                 |
两个现象根因相同：整条链路的事务边界没有按业务期望切分，写操作复用了一个"已经提交但尚未清理"的事务上下文，导致 entity persist 进 Session 后永远不会再被 commit。
* 完整调用链与事务边界
先把链路画清楚（→ 表示方法调用，每行右侧标注 @Transactional 状态）：
#+begin_src java
  HTTP /workFlow/checkCallback
  └─ CheckFlowApplicationImpl.checkCallback                     [@Transactional → TX_outer]
     └─ flowCallbackApplication.handleAfterCallback             [@Transactional(REQUIRES_NEW) → 挂起 TX_outer，开 TX_inner]
        └─ publishEvent(FlowCallbackEvent)
           (事件被注册为 TX_inner 的 AFTER_COMMIT 同步回调)
     ── TX_inner.commit() ──
        ↓ 灰色地带：commit 完成、cleanup 尚未执行
     └─ FlowCallbackEventDispatcher.handleFlowCallbackEvent     [@TransactionalEventListener(AFTER_COMMIT)]
        └─ PreRequestDayFlowCallbackListener.handleCallback     [无 @Transactional]
           ├─ autoCreatePurchaseBill         (原: 无 @Tx，内部 saveBills @Tx REQUIRED)
           ├─ autoApprove                    (原: 无 @Tx，内部 submitCheck @Tx REQUIRED)
           └─ autoCreateInWarehouseBill      (原: @Tx REQUIRED)
  ── 回到 TX_outer，TX_outer.commit() ──
#+end_src
记住三个关键事实：
- **TX_outer** 是 `checkCallback` 自己开的，事件触发时它处于"挂起"状态。
- **TX_inner** 是 `handleAfterCallback` 用 `REQUIRES_NEW` 开的，事件触发**就发生在它的 commit 流程里**。
- 监听器方法本身没有 `@Transactional`。

: TX = Transaction 事务
* @TransactionalEventListener(AFTER_COMMIT) 到底在什么时机触发？
很多人误以为"AFTER_COMMIT 触发时已经没有任何事务了"。实际上要看 Spring 的 commit 流程（AbstractPlatformTransactionManager.processCommit）：
#+begin_src emacs-lisp
  1. prepareForCommit()
  2. triggerBeforeCommit()
  3. triggerBeforeCompletion()
  4. doCommit()                        ← 物理 commit 到 DB（TX_inner 落库完成）
  5. triggerAfterCommit()              ← ★ AFTER_COMMIT 回调在这里执行 ★
  6. triggerAfterCompletion()
  7. cleanupAfterCompletion()          ← 这一步才真正解绑资源、resume 挂起的 TX_outer
#+end_src
也就是说，AFTER_COMMIT 回调执行时，处于一个**"灰色地带"**：
- TX_inner **物理上已提交**，但 `TransactionSynchronizationManager` 里**还没解绑**（Connection、EntityManager 等资源仍挂在当前线程上）。
- TX_outer 处于挂起状态，但因为 cleanup 还没跑，它的恢复也没发生。

这个"灰色地带"会直接影响后续在监听器里调用的 `@Transactional` 方法的传播行为。
* @Transactional 传播级别在"灰色地带"里的实际表现
`@Transactional` 默认是 `Propagation.REQUIRED`。它的判断逻辑（简化）是：

: "当前线程是否已经有一个事务上下文（看 `TransactionSynchronizationManager` 的资源绑定）？有 → 加入它；没有 → 开一个新的。"
在 AFTER_COMMIT 这个灰色地带里：
| 调用方式     | 实际行为                                                                                                                                                               |
| REQUIRED     | 大概率复用 TX_inner 残留的资源（Connection / Hibernate Session），但这个事务已经 commit 过了。新的 DML 操作进了同一个 Session，但这个 Session 永远不会再 commit 第二次 |
| REQUIRES_NEW | 强制挂起当前残留上下文，开一个全新的物理事务，方法返回时独立 commit                                                                                                    |
这就是关键陷阱：
: AFTER_COMMIT 监听器里用 REQUIRED 的 @Transactional 方法，写入的数据有极大概率"看起来成功了，实际从未 commit"。
具体落到我们的代码：
现象 ① 的成因（查不到采购单）
#+begin_src emacs-lisp
  autoCreatePurchaseBill (无 @Tx)
    └─ saveBills (@Tx REQUIRED) → 加入残留 Session
                                → entity persist 到一级缓存
                                → 方法返回，没有新 commit / flush
  autoCreateInWarehouseBill (@Tx REQUIRED) → 加入同一残留 Session
    └─ purchaseBillQuery.queryBySourceId(billId)
         → 即便 JPA AUTO flush 把缓存写到 Connection，
           前一步的"残留事务"也从未真正 commit，
           更糟糕的是：整条链结束后这些变更随挂起事务清理一起被丢弃
#+end_src
结果：第二步查询返回空集合，`autoCreateInWarehouseBill` 直接 `return RetData.error("采购单据不存在")`。

**现象 ② 的成因（日志成功但单据没生成）**

把前两步改成 `REQUIRES_NEW` 后，采购单确实被 commit 了。第三步 `autoCreateInWarehouseBill` 仍是 `REQUIRED`：
#+begin_src emacs-lisp
  autoCreateInWarehouseBill (@Tx REQUIRED) → 复用残留上下文
    └─ operationBillApplication.saveBill (@Tx REQUIRED) → 同一上下文
         → entity 进 Session
         → 方法链返回，没异常
    → return RetData.ok()

  listener: createInWarehouseBillResult.isOk() == true
             → log.info("自动创建入库点检单成功")    ← 日志被打出来
             → markSuccess(...)                       ← 业务日志表也写"成功"

  真实情况:
    这个"挂着的事务"在后续 cleanupAfterCompletion() 阶段被丢弃，
    入库点检单的 INSERT 从未真正 commit 到数据库。
#+end_src
→ 日志骗了我们：返回值 OK ≠ 数据已经 commit。
* 两层修复策略
