_posts/java/2026-05-21-spring-ghost-transaction.html
---
layout: post
title: Spring 事务 + 事务监听器引发的"幽灵事务"陷阱与架构层修复方案
author: zrg
description: Spring 事务 + 事务监听器引发的"幽灵事务"陷阱与架构层修复方案
excerpt: 
comments: true
categories: 
- java
tags:
- Spring
- 事务
---
<div id="outline-container-org9d8830b" class="outline-2">
<h2 id="org9d8830b"><span class="section-number-2">1.</span> 问题现象回顾</h2>
<div class="outline-text-2" id="text-1">
<p>
在"日采请购单审批回调"这条链路里发生了两个怪现象：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">现象</td>
<td class="org-left">表现</td>
</tr>

<tr>
<td class="org-left">① 查不到上一步的数据</td>
<td class="org-left">autoCreateInWarehouseBill 查 purchaseBillQuery.queryBySourceId(billId) 拿不到刚创建的采购单</td>
</tr>

<tr>
<td class="org-left">② 日志成功但数据不落库</td>
<td class="org-left">listener 打出 自动创建入库点检单成功，DB 里查不到入库点检单</td>
</tr>
</tbody>
</table>
<p>
两个现象根因相同：整条链路的事务边界没有按业务期望切分，写操作复用了一个"已经提交但尚未清理"的事务上下文，导致 entity persist 进 Session 后永远不会再被 commit。
</p>
</div>
</div>
<div id="outline-container-orgddea4a9" class="outline-2">
<h2 id="orgddea4a9"><span class="section-number-2">2.</span> 完整调用链与事务边界</h2>
<div class="outline-text-2" id="text-2">
<p>
先把链路画清楚（→ 表示方法调用，每行右侧标注 @Transactional 状态）：
</p>
<div class="org-src-container">
<pre class="src src-java">HTTP /workFlow/checkCallback
&#9492;&#9472; CheckFlowApplicationImpl.checkCallback                     [<span style="color: #ff6e65;">@Transactional</span> &#8594; TX_outer]
   &#9492;&#9472; flowCallbackApplication.handleAfterCallback             [<span style="color: #ff6e65;">@Transactional</span>(REQUIRES_NEW) &#8594; &#25346;&#36215; TX_outer&#65292;&#24320; TX_inner]
      &#9492;&#9472; publishEvent(FlowCallbackEvent)
         (&#20107;&#20214;&#34987;&#27880;&#20876;&#20026; TX_inner &#30340; <span style="color: #4e9dff;">AFTER_COMMIT</span> <span style="color: #e45c9c;">&#21516;&#27493;&#22238;&#35843;</span>)
   &#9472;&#9472; TX_inner.commit() &#9472;&#9472;
      &#8595; &#28784;&#33394;&#22320;&#24102;&#65306;commit &#23436;&#25104;&#12289;cleanup &#23578;&#26410;&#25191;&#34892;
   &#9492;&#9472; FlowCallbackEventDispatcher.handleFlowCallbackEvent     [<span style="color: #ff6e65;">@TransactionalEventListener</span>(AFTER_COMMIT)]
      &#9492;&#9472; PreRequestDayFlowCallbackListener.handleCallback     [&#26080; <span style="color: #ff6e65;">@Transactional</span>]
         &#9500;&#9472; autoCreatePurchaseBill         (&#21407;: &#26080; <span style="color: #ff6e65;">@Tx</span>&#65292;&#20869;&#37096; saveBills <span style="color: #ff6e65;">@Tx</span> REQUIRED)
         &#9500;&#9472; autoApprove                    (&#21407;: &#26080; <span style="color: #ff6e65;">@Tx</span>&#65292;&#20869;&#37096; submitCheck <span style="color: #ff6e65;">@Tx</span> REQUIRED)
         &#9492;&#9472; autoCreateInWarehouseBill      (&#21407;: <span style="color: #ff6e65;">@Tx</span> REQUIRED)
&#9472;&#9472; &#22238;&#21040; TX_outer&#65292;TX_outer.commit() &#9472;&#9472;
</pre>
</div>
<p>
记住三个关键事实：
</p>
<ul class="org-ul">
<li><b><b>TX_outer</b></b> 是 `checkCallback` 自己开的，事件触发时它处于"挂起"状态。</li>
<li><b><b>TX_inner</b></b> 是 `handleAfterCallback` 用 `REQUIRES_NEW` 开的，事件触发**就发生在它的 commit 流程里**。</li>
<li>监听器方法本身没有 `@Transactional`。</li>
</ul>

<pre class="example">
TX = Transaction 事务
</pre>
</div>
</div>
<div id="outline-container-org7929c03" class="outline-2">
<h2 id="org7929c03"><span class="section-number-2">3.</span> @TransactionalEventListener(AFTER_COMMIT) 到底在什么时机触发？</h2>
<div class="outline-text-2" id="text-3">
<p>
很多人误以为"AFTER_COMMIT 触发时已经没有任何事务了"。实际上要看 Spring 的 commit 流程（AbstractPlatformTransactionManager.processCommit）：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">1. prepareForCommit()
2. triggerBeforeCommit()
3. triggerBeforeCompletion()
4. doCommit()                        &#8592; &#29289;&#29702; commit &#21040; DB&#65288;TX_inner &#33853;&#24211;&#23436;&#25104;&#65289;
5. triggerAfterCommit()              &#8592; &#9733; AFTER_COMMIT &#22238;&#35843;&#22312;&#36825;&#37324;&#25191;&#34892; &#9733;
6. triggerAfterCompletion()
7. cleanupAfterCompletion()          &#8592; &#36825;&#19968;&#27493;&#25165;&#30495;&#27491;&#35299;&#32465;&#36164;&#28304;&#12289;resume &#25346;&#36215;&#30340; TX_outer
</pre>
</div>
<p>
也就是说，AFTER_COMMIT 回调执行时，处于一个**"灰色地带"**：
</p>
<ul class="org-ul">
<li>TX_inner **物理上已提交**，但 `TransactionSynchronizationManager` 里**还没解绑**（Connection、EntityManager 等资源仍挂在当前线程上）。</li>
<li>TX_outer 处于挂起状态，但因为 cleanup 还没跑，它的恢复也没发生。</li>
</ul>

<p>
这个"灰色地带"会直接影响后续在监听器里调用的 `@Transactional` 方法的传播行为。
</p>
</div>
</div>
<div id="outline-container-org61461f2" class="outline-2">
<h2 id="org61461f2"><span class="section-number-2">4.</span> @Transactional 传播级别在"灰色地带"里的实际表现</h2>
<div class="outline-text-2" id="text-4">
<p>
`@Transactional` 默认是 `Propagation.REQUIRED`。它的判断逻辑（简化）是：
</p>

<pre class="example">
"当前线程是否已经有一个事务上下文（看 `TransactionSynchronizationManager` 的资源绑定）？有 → 加入它；没有 → 开一个新的。"
</pre>

<p>
在 AFTER_COMMIT 这个灰色地带里：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">调用方式</td>
<td class="org-left">实际行为</td>
</tr>

<tr>
<td class="org-left">REQUIRED</td>
<td class="org-left">大概率复用 TX_inner 残留的资源（Connection / Hibernate Session），但这个事务已经 commit 过了。新的 DML 操作进了同一个 Session，但这个 Session 永远不会再 commit 第二次</td>
</tr>

<tr>
<td class="org-left">REQUIRES_NEW</td>
<td class="org-left">强制挂起当前残留上下文，开一个全新的物理事务，方法返回时独立 commit</td>
</tr>
</tbody>
</table>
<p>
这就是关键陷阱：
</p>
<pre class="example">
AFTER_COMMIT 监听器里用 REQUIRED 的 @Transactional 方法，写入的数据有极大概率"看起来成功了，实际从未 commit"。
</pre>

<p>
具体落到我们的代码：
现象 ① 的成因（查不到采购单）
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">autoCreatePurchaseBill (&#26080; @Tx)
  &#9492;&#9472; saveBills (@Tx REQUIRED) &#8594; &#21152;&#20837;&#27531;&#30041; Session
                              &#8594; entity persist &#21040;&#19968;&#32423;&#32531;&#23384;
                              &#8594; &#26041;&#27861;&#36820;&#22238;&#65292;&#27809;&#26377;&#26032; commit / flush
autoCreateInWarehouseBill (@Tx REQUIRED) &#8594; &#21152;&#20837;&#21516;&#19968;&#27531;&#30041; Session
  &#9492;&#9472; purchaseBillQuery.queryBySourceId(billId)
       &#8594; &#21363;&#20415; JPA AUTO flush &#25226;&#32531;&#23384;&#20889;&#21040; Connection&#65292;
         &#21069;&#19968;&#27493;&#30340;<span style="color: #6adf73;">"&#27531;&#30041;&#20107;&#21153;"</span>&#20063;&#20174;&#26410;&#30495;&#27491; commit&#65292;
         &#26356;&#31967;&#31957;&#30340;&#26159;&#65306;&#25972;&#26465;&#38142;&#32467;&#26463;&#21518;&#36825;&#20123;&#21464;&#26356;&#38543;&#25346;&#36215;&#20107;&#21153;&#28165;&#29702;&#19968;&#36215;&#34987;&#20002;&#24323;
</pre>
</div>
<p>
结果：第二步查询返回空集合，`autoCreateInWarehouseBill` 直接 `return RetData.error("采购单据不存在")`。
</p>

<p>
<b><b>现象 ② 的成因（日志成功但单据没生成）</b></b>
</p>

<p>
把前两步改成 `REQUIRES_NEW` 后，采购单确实被 commit 了。第三步 `autoCreateInWarehouseBill` 仍是 `REQUIRED`：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">autoCreateInWarehouseBill (@Tx REQUIRED) &#8594; &#22797;&#29992;&#27531;&#30041;&#19978;&#19979;&#25991;
  &#9492;&#9472; operationBillApplication.saveBill (@Tx REQUIRED) &#8594; &#21516;&#19968;&#19978;&#19979;&#25991;
       &#8594; entity &#36827; Session
       &#8594; &#26041;&#27861;&#38142;&#36820;&#22238;&#65292;&#27809;&#24322;&#24120;
  &#8594; return RetData.ok()

listener: createInWarehouseBillResult.isOk() == true
           &#8594; log.info(<span style="color: #6adf73;">"&#33258;&#21160;&#21019;&#24314;&#20837;&#24211;&#28857;&#26816;&#21333;&#25104;&#21151;"</span>)    &#8592; &#26085;&#24535;&#34987;&#25171;&#20986;&#26469;
           &#8594; markSuccess(...)                       &#8592; &#19994;&#21153;&#26085;&#24535;&#34920;&#20063;&#20889;<span style="color: #6adf73;">"&#25104;&#21151;"</span>

&#30495;&#23454;&#24773;&#20917;:
  &#36825;&#20010;<span style="color: #6adf73;">"&#25346;&#30528;&#30340;&#20107;&#21153;"</span>&#22312;&#21518;&#32493; cleanupAfterCompletion() &#38454;&#27573;&#34987;&#20002;&#24323;&#65292;
  &#20837;&#24211;&#28857;&#26816;&#21333;&#30340; INSERT &#20174;&#26410;&#30495;&#27491; commit &#21040;&#25968;&#25454;&#24211;&#12290;
</pre>
</div>
<p>
→ 日志骗了我们：返回值 OK ≠ 数据已经 commit。
</p>
</div>
</div>
