_orgs/_posts/java/2026-05-21-spring-ghost-transaction.org
** 第一层：业务语义层 —— 给"必须独立提交"的步骤标 REQUIRES_NEW
业务上，"采购单创建成功"和"自动审批通过"是不可回滚的事实，不应因为后续入库点检单失败被回滚。这是业务语义边界，应在 application service 上声明：
AutoCreatePurchaseBillApplicationImpl.java
#+begin_src java
  @Override
  @Transactional(propagation = Propagation.REQUIRES_NEW, rollbackFor = Exception.class)
  public RetData<?> autoCreatePurchaseBill(Long billId, UserDto userDto) { ... }

  @Override
  @Transactional(propagation = Propagation.REQUIRES_NEW, rollbackFor = Exception.class)
  public void autoApprove(Long billId) { ... }
#+end_src
`REQUIRES_NEW` 的语义是：

1. 把当前线程上**所有已绑定的事务资源**（包括灰色地带的残留）**强制挂起**；
2. 从连接池**重新拿一个 Connection**，开一个**全新的物理事务**；
3. 方法返回时**独立 commit**这个新事务；
4. 然后恢复之前挂起的资源。

这就把每一步彻底变成"自包含、独立可见"的事务单元：
#+begin_src emacs-lisp
  autoCreatePurchaseBill   [REQUIRES_NEW] → 独立 commit → DB 里看得到采购单
  autoApprove              [REQUIRES_NEW] → 独立 commit → 审批状态落库
  autoCreateInWarehouseBill[REQUIRES_NEW] → 独立 commit → 入库点检单落库
#+end_src
第三步查询第一步的数据时，因为前两步已经物理 commit，任何新事务、任何 Session 都能看到，不存在可见性问题。同时，第三步的"成功"日志严格等价于"已 commit"。
** 第二层：架构层 —— 在事件分发器上加 REQUIRES_NEW 安全网
业务语义层只解决了 `PreRequestDayFlowCallbackListener` 一个监听器。工程里 5 个 `FlowCallbackListener` 都跑在同一个灰色地带，**每个监听器内部都加 REQUIRES_NEW 既繁琐又容易破坏既有事务原子性**（domain 层方法可能被正常请求路径以 REQUIRED 复用）。

更根本的修法是在 `FlowCallbackEventDispatcher` 中**统一**用 `TransactionTemplate(REQUIRES_NEW)` 包裹 listener 调用：
#+begin_src java
  public FlowCallbackEventDispatcher(List<FlowCallbackListener> listeners,
                                     AutoCreateBillLogDomainService autoCreateBillLogDomainService,
                                     PlatformTransactionManager transactionManager) {
      this.listeners = listeners;
      this.autoCreateBillLogDomainService = autoCreateBillLogDomainService;
      this.listenerTxTemplate = new TransactionTemplate(transactionManager);
      this.listenerTxTemplate.setPropagationBehavior(TransactionDefinition.PROPAGATION_REQUIRES_NEW);
  }

  try {
      listenerTxTemplate.execute(status -> {
          listener.handleCallback(billId);
          return null;
      });
      handleSuccess(callbackLog, billType, billId);
  } catch (Exception e) {
      handleFailure(callbackLog, billType, billId, e.getMessage(), e);
  }
#+end_src
加上之后，链路变成：
#+begin_src emacs-lisp
  Dispatcher.handleFlowCallbackEvent (AFTER_COMMIT 灰色地带)
  └─ requiresNewTx.execute(...)                  ← 挂起灰色地带残留，开 TX_listener
     └─ listener.handleCallback(billId)
        ├─ [@Tx REQUIRES_NEW] 业务必须独立提交的步骤   → 自开 TX_xxx 独立 commit
        └─ [@Tx REQUIRED] 跟监听器同生共死的步骤      → 加入 TX_listener，随 TX_listener 一起 commit
  ── TX_listener.commit() ──
  ── 残留资源恢复 ──
#+end_src
**关键设计点:**

1. **只包裹 `listener.handleCallback`**：`createLog / markSuccess / markFailed` 不进包裹，它们自己已经是 `REQUIRES_NEW`，并且日志必须在 listener TX 回滚时仍能写入"失败"记录。
2. **用 `execute(... return null)`**：项目用 Spring Boot 2.1.4（Spring 5.1.x），没有 5.2+ 才有的 `executeWithoutResult` 方法。
3. **异常语义保持**：lambda 里抛 RuntimeException → `TransactionTemplate.execute` rollback `TX_listener` 并抛出 → 外层 `try/catch` 接住 → 走 `handleFailure` → `markFailed` 写日志（独立 REQUIRES_NEW，不受 `TX_listener` 回滚影响）。
4. **去掉 `@RequiredArgsConstructor`**：因为需要在构造器里初始化 `TransactionTemplate`，改用显式构造器。

**两层修复的协同效果（不是替代关系）**
#+begin_src emacs-lisp
  TX_listener {                                       ← 架构层安全网（dispatcher）
      [TX_purchase REQUIRES_NEW]  独立 commit          ← 业务语义边界：采购单不可回滚
      [TX_approve  REQUIRES_NEW]  独立 commit          ← 业务语义边界：审批不可回滚
      autoCreateInWarehouseBill (REQUIRED) join TX_listener  ← 失败时只回滚自己
  }
#+end_src
- **业务语义层（REQUIRES_NEW on application service）**：保证业务原子性边界。
- **架构层（REQUIRES_NEW on dispatcher）**：保证灰色地带下 REQUIRED 也能正确提交。
- **两者不冲突、不重复**，是不同维度的保险。
* 为什么不在 listener 上加 @Transactional 解决？
这是个常见的"看起来更优雅"的方案，但对这个场景**行不通**：

1. **`@TransactionalEventListener` 的 listener 方法本身加 `@Transactional` 会迷惑事务边界**——它跑在 AFTER_COMMIT 的灰色地带，加 REQUIRED 仍会撞上残留上下文，加 REQUIRES_NEW 又会把"三个独立步骤"重新捆成一个大事务（其中一步失败导致前两步也回滚，与业务期望不符）。
2. 业务上希望"采购单创建成功就保留，入库点检单失败只回滚自己"，**天然就是三个独立事务边界**。
3. listener 是回调编排层，让它做事务编排会污染职责。应该让**应用服务层**自己声明事务边界（这是 DDD 分层里 application service 的天职）。

所以正确的修法就是我们做的：**把三个应用服务方法各自标 `@Transactional(REQUIRES_NEW)`**。
