_posts/java/2026-05-21-spring-ghost-transaction.html
<div id="outline-container-org0e21c3d" class="outline-2">
<h2 id="org0e21c3d"><span class="section-number-2">5.</span> 两层修复策略</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orge577b23" class="outline-3">
<h3 id="orge577b23"><span class="section-number-3">5.1.</span> 第一层：业务语义层 —— 给"必须独立提交"的步骤标 REQUIRES_NEW</h3>
<div class="outline-text-3" id="text-5-1">
<p>
业务上，"采购单创建成功"和"自动审批通过"是不可回滚的事实，不应因为后续入库点检单失败被回滚。这是业务语义边界，应在 application service 上声明：
AutoCreatePurchaseBillApplicationImpl.java
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ff6e65;">@Override</span>
<span style="color: #ff6e65;">@Transactional</span>(propagation = <span style="color: #ff6e65;">Propagation</span>.REQUIRES_NEW, rollbackFor = Exception.<span style="color: #4e9dff;">class</span>)
<span style="color: #4e9dff;">public</span> <span style="color: #4e9dff;">RetData</span>&lt;?&gt; <span style="color: #91f3e7;">autoCreatePurchaseBill</span>(<span style="color: #4e9dff;">Long</span> <span style="color: #e45c9c;">billId</span>, <span style="color: #4e9dff;">UserDto</span> <span style="color: #e45c9c;">userDto</span>) { ... }

<span style="color: #ff6e65;">@Override</span>
<span style="color: #ff6e65;">@Transactional</span>(propagation = <span style="color: #ff6e65;">Propagation</span>.REQUIRES_NEW, rollbackFor = Exception.<span style="color: #4e9dff;">class</span>)
<span style="color: #4e9dff;">public</span> <span style="color: #4e9dff;">void</span> <span style="color: #91f3e7;">autoApprove</span>(<span style="color: #4e9dff;">Long</span> <span style="color: #e45c9c;">billId</span>) { ... }
</pre>
</div>
<p>
`REQUIRES_NEW` 的语义是：
</p>

<ol class="org-ol">
<li>把当前线程上**所有已绑定的事务资源**（包括灰色地带的残留）**强制挂起**；</li>
<li>从连接池**重新拿一个 Connection**，开一个**全新的物理事务**；</li>
<li>方法返回时**独立 commit**这个新事务；</li>
<li>然后恢复之前挂起的资源。</li>
</ol>

<p>
这就把每一步彻底变成"自包含、独立可见"的事务单元：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">autoCreatePurchaseBill   [REQUIRES_NEW] &#8594; &#29420;&#31435; commit &#8594; DB &#37324;&#30475;&#24471;&#21040;&#37319;&#36141;&#21333;
autoApprove              [REQUIRES_NEW] &#8594; &#29420;&#31435; commit &#8594; &#23457;&#25209;&#29366;&#24577;&#33853;&#24211;
autoCreateInWarehouseBill[REQUIRES_NEW] &#8594; &#29420;&#31435; commit &#8594; &#20837;&#24211;&#28857;&#26816;&#21333;&#33853;&#24211;
</pre>
</div>
<p>
第三步查询第一步的数据时，因为前两步已经物理 commit，任何新事务、任何 Session 都能看到，不存在可见性问题。同时，第三步的"成功"日志严格等价于"已 commit"。
</p>
</div>
</div>
<div id="outline-container-org2f046ea" class="outline-3">
<h3 id="org2f046ea"><span class="section-number-3">5.2.</span> 第二层：架构层 —— 在事件分发器上加 REQUIRES_NEW 安全网</h3>
<div class="outline-text-3" id="text-5-2">
<p>
业务语义层只解决了 `PreRequestDayFlowCallbackListener` 一个监听器。工程里 5 个 `FlowCallbackListener` 都跑在同一个灰色地带，**每个监听器内部都加 REQUIRES_NEW 既繁琐又容易破坏既有事务原子性**（domain 层方法可能被正常请求路径以 REQUIRED 复用）。
</p>

<p>
更根本的修法是在 `FlowCallbackEventDispatcher` 中**统一**用 `TransactionTemplate(REQUIRES_NEW)` 包裹 listener 调用：
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4e9dff;">public</span> FlowCallbackEventDispatcher(<span style="color: #4e9dff;">List</span>&lt;<span style="color: #4e9dff;">FlowCallbackListener</span>&gt; <span style="color: #e45c9c;">listeners</span>,
                                   <span style="color: #4e9dff;">AutoCreateBillLogDomainService</span> <span style="color: #e45c9c;">autoCreateBillLogDomainService</span>,
                                   PlatformTransactionManager transactionManager) {
    <span style="color: #4e9dff;">this</span>.listeners = listeners;
    <span style="color: #4e9dff;">this</span>.autoCreateBillLogDomainService = autoCreateBillLogDomainService;
    <span style="color: #4e9dff;">this</span>.listenerTxTemplate = <span style="color: #4e9dff;">new</span> <span style="color: #4e9dff;">TransactionTemplate</span>(transactionManager);
    <span style="color: #4e9dff;">this</span>.listenerTxTemplate.setPropagationBehavior(<span style="color: #ff6e65;">TransactionDefinition</span>.PROPAGATION_REQUIRES_NEW);
}

<span style="color: #4e9dff;">try</span> {
    listenerTxTemplate.execute(status -&gt; {
        listener.handleCallback(billId);
        <span style="color: #4e9dff;">return</span> <span style="color: #ff6e65;">null</span>;
    });
    handleSuccess(callbackLog, billType, billId);
} <span style="color: #4e9dff;">catch</span> (Exception e) {
    handleFailure(callbackLog, billType, billId, e.getMessage(), e);
}
</pre>
</div>
<p>
加上之后，链路变成：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">Dispatcher.handleFlowCallbackEvent (AFTER_COMMIT &#28784;&#33394;&#22320;&#24102;)
&#9492;&#9472; requiresNewTx.execute(...)                  &#8592; &#25346;&#36215;&#28784;&#33394;&#22320;&#24102;&#27531;&#30041;&#65292;&#24320; TX_listener
   &#9492;&#9472; listener.handleCallback(billId)
      &#9500;&#9472; [@Tx REQUIRES_NEW] &#19994;&#21153;&#24517;&#39035;&#29420;&#31435;&#25552;&#20132;&#30340;&#27493;&#39588;   &#8594; &#33258;&#24320; TX_xxx &#29420;&#31435; commit
      &#9492;&#9472; [@Tx REQUIRED] &#36319;&#30417;&#21548;&#22120;&#21516;&#29983;&#20849;&#27515;&#30340;&#27493;&#39588;      &#8594; &#21152;&#20837; TX_listener&#65292;&#38543; TX_listener &#19968;&#36215; commit
&#9472;&#9472; TX_listener.commit() &#9472;&#9472;
&#9472;&#9472; &#27531;&#30041;&#36164;&#28304;&#24674;&#22797; &#9472;&#9472;
</pre>
</div>
<p>
<b><b>关键设计点:</b></b>
</p>

<ol class="org-ol">
<li>**只包裹 `listener.handleCallback`**：`createLog / markSuccess / markFailed` 不进包裹，它们自己已经是 `REQUIRES_NEW`，并且日志必须在 listener TX 回滚时仍能写入"失败"记录。</li>
<li>**用 `execute(&#x2026; return null)`**：项目用 Spring Boot 2.1.4（Spring 5.1.x），没有 5.2+ 才有的 `executeWithoutResult` 方法。</li>
<li>**异常语义保持**：lambda 里抛 RuntimeException → `TransactionTemplate.execute` rollback `TX_listener` 并抛出 → 外层 `try/catch` 接住 → 走 `handleFailure` → `markFailed` 写日志（独立 REQUIRES_NEW，不受 `TX_listener` 回滚影响）。</li>
<li>**去掉 `@RequiredArgsConstructor`**：因为需要在构造器里初始化 `TransactionTemplate`，改用显式构造器。</li>
</ol>

<p>
<b><b>两层修复的协同效果（不是替代关系）</b></b>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">TX_listener {                                       &#8592; &#26550;&#26500;&#23618;&#23433;&#20840;&#32593;&#65288;dispatcher&#65289;
    [TX_purchase REQUIRES_NEW]  &#29420;&#31435; commit          &#8592; &#19994;&#21153;&#35821;&#20041;&#36793;&#30028;&#65306;&#37319;&#36141;&#21333;&#19981;&#21487;&#22238;&#28378;
    [TX_approve  REQUIRES_NEW]  &#29420;&#31435; commit          &#8592; &#19994;&#21153;&#35821;&#20041;&#36793;&#30028;&#65306;&#23457;&#25209;&#19981;&#21487;&#22238;&#28378;
    autoCreateInWarehouseBill (REQUIRED) join TX_listener  &#8592; &#22833;&#36133;&#26102;&#21482;&#22238;&#28378;&#33258;&#24049;
}
</pre>
</div>
<ul class="org-ul">
<li>**业务语义层（REQUIRES_NEW on application service）**：保证业务原子性边界。</li>
<li>**架构层（REQUIRES_NEW on dispatcher）**：保证灰色地带下 REQUIRED 也能正确提交。</li>
<li>**两者不冲突、不重复**，是不同维度的保险。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org419cba7" class="outline-2">
<h2 id="org419cba7"><span class="section-number-2">6.</span> 为什么不在 listener 上加 @Transactional 解决？</h2>
<div class="outline-text-2" id="text-6">
<p>
这是个常见的"看起来更优雅"的方案，但对这个场景**行不通**：
</p>

<ol class="org-ol">
<li>**`@TransactionalEventListener` 的 listener 方法本身加 `@Transactional` 会迷惑事务边界**——它跑在 AFTER_COMMIT 的灰色地带，加 REQUIRED 仍会撞上残留上下文，加 REQUIRES_NEW 又会把"三个独立步骤"重新捆成一个大事务（其中一步失败导致前两步也回滚，与业务期望不符）。</li>
<li>业务上希望"采购单创建成功就保留，入库点检单失败只回滚自己"，**天然就是三个独立事务边界**。</li>
<li>listener 是回调编排层，让它做事务编排会污染职责。应该让**应用服务层**自己声明事务边界（这是 DDD 分层里 application service 的天职）。</li>
</ol>

<p>
所以正确的修法就是我们做的：**把三个应用服务方法各自标 `@Transactional(REQUIRES_NEW)`**。
</p>
</div>
</div>
