_posts/java/2026-05-21-spring-ghost-transaction.html
<div id="outline-container-orgf140112" class="outline-2">
<h2 id="orgf140112"><span class="section-number-2">7.</span> 可以提炼的几条通用经验</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li><p>
@TransactionalEventListener(AFTER_COMMIT) 里调用的写操作，必须有明确的事务边界
不要依赖默认 `REQUIRED`。两个方案二选一：
</p>
<ul class="org-ul">
<li>**集中式**（推荐）：在事件分发器统一用 `TransactionTemplate(REQUIRES_NEW)` 包裹 listener 调用。一处改、N 处受益。</li>
<li>**分布式**：每个 listener 调用的入口方法都自带 `@Transactional(REQUIRES_NEW)`。</li>
</ul>
<p>
监听器里要写库 / 调用其他写操作的 service，**不要依赖默认 REQUIRED**。否则一旦撞上"灰色地带"，会出现"无异常但数据丢失"，这是最难排查的 bug 类型。
</p></li>
<li><p>
"无 @Transactional 注解的方法"不等于"无事务"
AutoCreatePurchaseBillApplicationImpl.autoCreatePurchaseBill 本身没注解，但它内部调用了 saveBills (@Tx REQUIRED)。在不同的上层上下文中，这个 REQUIRED 的实际行为完全不同：
</p>
<ul class="org-ul">
<li>上层无事务 → 新开并自己 commit</li>
<li>上层有正常 TX → 加入上层</li>
<li>上层是"灰色地带残留" → 加入残留，永不 commit ← <b><b>就是这个场景</b></b></li>
</ul>

<pre class="example">
做应用服务编排的时候，事务边界一定要在 application service 这一层就明确标注，不要让它"看运气"。
</pre></li>
<li>RetData.ok() ≠ "数据已经持久化"
任何依赖返回值判断业务结果的代码，都隐含一个假设：返回值是在事务 commit 之后才被消费的。这个假设在 REQUIRED 嵌套时不成立——返回值是方法栈帧弹出时拿到的，而 commit 发生在最外层 TX 结束时。</li>
<li><p>
@TransactionalEventListener 选择 phase 时的取舍
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Phase</th>
<th scope="col" class="org-left">时机</th>
<th scope="col" class="org-left">适用场景</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">BEFORE_COMMIT</td>
<td class="org-left">TX commit 之前</td>
<td class="org-left">还需要参与原事务，必须保证一致</td>
</tr>

<tr>
<td class="org-left">AFTER_COMMIT</td>
<td class="org-left">TX commit 之后（但 cleanup 之前）</td>
<td class="org-left">解耦后置动作，原事务必须已经成功</td>
</tr>

<tr>
<td class="org-left">AFTER_ROLLBACK</td>
<td class="org-left">TX rollback 之后</td>
<td class="org-left">失败补偿</td>
</tr>

<tr>
<td class="org-left">AFTER_COMPLETION</td>
<td class="org-left">不管成功失败</td>
<td class="org-left">资源清理</td>
</tr>
</tbody>
</table>
<p>
只要选了 AFTER_*，就一定要意识到回调代码处于"灰色地带"，回调里要写库就一律 REQUIRES_NEW。
</p></li>
<li>fallbackExecution=true 是把双刃剑
@TransactionalEventListener(AFTER_COMMIT, fallbackExecution=true) 意思是"如果发布事件时没有事务上下文，也照常同步触发"。这让代码兼容了"无事务路径"（比如手动重试入口），但也意味着监听器内的事务行为要在"有 TX 上下文"和"无 TX 上下文"两种情况下都正确。REQUIRES_NEW 在两种情况下都是确定行为（新开 TX），是最安全的选择。</li>
<li>REQUIRES_NEW 的代价要心里有数
<ul class="org-ul">
<li>会从连接池**多拿一个 Connection**。在嵌套调用时如果池子小，可能引发死锁（持有 Conn1 等 Conn2）。</li>
<li>父事务的回滚**不会**回滚 `REQUIRES_NEW` 子事务的修改 → 业务上必须接受这种"已提交无法撤销"的语义。</li>
<li>不要在 read-only 场景滥用，常规读不需要 REQUIRES_NEW。</li>
</ul></li>
<li><p>
"业务语义边界" vs "技术安全网"是两件事
我们最终的修复是两层叠加：
</p>
<ul class="org-ul">
<li>application service 的 @Transactional(REQUIRES_NEW) —— 业务语义边界，表达"这一步必须独立提交，不可回滚"；</li>
<li>dispatcher 的 TransactionTemplate(REQUIRES_NEW) —— 技术安全网，兜住"REQUIRED 在灰色地带的不确定行为"。</li>
</ul>
<p>
两者不互斥，业务边界不能用安全网替代（语义不同），安全网也不能用业务边界替代（覆盖面不够）。
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orge3730ea" class="outline-2">
<h2 id="orge3730ea"><span class="section-number-2">8.</span> 版本兼容备忘</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">API</th>
<th scope="col" class="org-left">引入版本</th>
<th scope="col" class="org-left">备选</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TransactionTemplate.executeWithoutResult(Consumer)</td>
<td class="org-left">Spring 5.2</td>
<td class="org-left">5.1 用 execute(TransactionCallback) + return null</td>
</tr>

<tr>
<td class="org-left">@TransactionalEventListener</td>
<td class="org-left">Spring 4.2</td>
<td class="org-left">—</td>
</tr>

<tr>
<td class="org-left">@TransactionalEventListener.fallbackExecution</td>
<td class="org-left">Spring 4.3</td>
<td class="org-left">—</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org46ac83b" class="outline-2">
<h2 id="org46ac83b"><span class="section-number-2">9.</span> 一句话总结</h2>
<div class="outline-text-2" id="text-9">
<pre class="example">
@TransactionalEventListener(AFTER_COMMIT) 监听器里执行的写操作链，必须每一步都用 @Transactional(REQUIRES_NEW) 划清事务边界；否则 REQUIRED 会复用一个"已 commit 但尚未清理"的幽灵事务上下文，导致写入"无异常 / 看起来成功 / 实际丢失"。
修复方式：
1）业务语义边界用方法级 @Transactional(REQUIRES_NEW)；
2）技术安全网用事件分发器集中包裹 TransactionTemplate(REQUIRES_NEW)。两层叠加，互不冲突。
</pre>
</div>
</div>
